[
  {
  "title": "Ar project - City Guide App",
  "name": "ar",
  "image": "/arCore/arCore.png",
  "thumbnail": "/arCore/arCoreThumbnail.png",
  "description": "Enhancing Travel with AR and Image Recognition: The City Guide Project",
  "icon": "",
  "date": "",
  "text": "The \"City Guide\" project is an innovative combination of machine learning and augmented reality (AR) that aims to enhance the travel experience. The project is divided into two main components: an image recognition system and an AR experience, with a primary focus on the latter.\n\nImage Recognition Component\n\nThe first component of the project involves capturing images through a camera and analyzing them with the help of a Vision API. This API is designed to detect landmarks within the captured image and return relevant information. The results are cross-referenced with a database that holds additional details about each landmark, allowing for further exploration. Additionally, the coordinates of the nearest landmark are calculated, helping the system understand the user’s exact location.\n\nAugmented Reality Experience\n\nOnce the image recognition system has detected a landmark, the project activates an AR session. Using the coordinates of the landmark, a virtual 3D object is positioned in the user's environment, displaying the name of the landmark. Users can interact with the object by tapping on it, which brings up a detailed view of the landmark, offering additional information.\n\nThe second prototype of the project, developed in Kotlin, improved upon the initial version, which was built with Flutter. The new version introduced features like a comprehensive landmark overview. Users can filter landmarks by city or category, easily searching for points of interest. Each landmark also provides more detailed information, enriching the user’s experience. Another notable addition is the route generation feature, which uses Google Maps to create optimal travel routes between selected landmarks, saving users time when planning their visits.\n\nUser-Friendly Interface with Jetpack Compose\n\nThe app’s user interface (UI) was enhanced with Jetpack Compose, a modern UI toolkit for Android development. This upgrade significantly improved the app's design, surpassing the limitations of traditional XML-based UI frameworks. Upon starting the app, users are greeted with two buttons: one for initiating the scanning process and another for accessing the landmark overview. The scanning process lets users capture an image of a landmark, while the overview offers a searchable list of landmarks, with filtering options based on city or category.\n\nThe landmark data is stored in Firebase, a NoSQL database that supports fast, real-time data retrieval, and was integrated during the machine learning phase of the project.\n\nConclusion\n\nThe \"City Guide\" project merges cutting-edge machine learning and AR technologies to offer travelers an immersive and interactive way to explore landmarks. By combining image recognition with AR, users can quickly identify landmarks and access detailed information, all while navigating with ease through optimized routes. This project has the potential to revolutionize the way we explore cities, making it an essential tool for modern-day travelers.",
  "tools": ["Kotlin", "ArCore"],
  "imageGallery": [
    {
      "tile": "maker space image 1",
      "src": "/arCore/arCore.png"
    },
    {
      "tile": "maker space image 1",
      "src": "/arCore/arCore-1.png"
    }
  ],
  "links": [
  ]
  },
  {
    "title": "Makerspace app",
    "name": "makerspace",
    "image": "/makerspace/makerspace-1.png",
    "thumbnail" : "/makerspace/makerspaceThumbnail.png",
    "date": "",
    "description": "Enhancing the Makerspace Experience: A Collaboration with the Makerspace Grand Garage",
    "icon": "",
    "text": "The Makerspace app was developed as a collaboration between my university and the Makerspace Grand Garage in Linz. Makerspaces are places where people can learn new skills and create projects on their own. The app allowed users to log in to their accounts securely through Auth0 and view their profile data, such as invoices and booked workshops. It also displayed upcoming workshops and showed badges earned from past workshops. The app was designed with gamification in mind to encourage users to complete more workshops by making the process more engaging. There were plans for additional features, such as the ability to book workshops directly through the app and stay updated with community news. Developed using Swift, the app retrieved data from the Grand Garage’s internal backend through API calls, ensuring users had up-to-date information on workshops and their profiles.",
    "tools":  ["Swift", "Auth0", "Storyblok"],
    "imageGallery": [
      {
        "tile": "maker space image 1",
        "src": "/makerspace/makerspace-1.png"
      },
      {
        "tile": "maker space image 2",
        "src": "/makerspace/makerspace-2.png"
      },
      {
        "tile": "maker space image 3",
        "src": "/makerspace/makerspace-3.png"
      },
      {
        "tile": "maker space image 4",
        "src": "/makerspace/makerspace-4.png"
      }
    ],
    "links": [
      {
        "title": "Power Point",
        "image": "",
        "type": "link",
        "link": "https://ikic.at/makerspace/makerspace-app.pdf"
      }
    ]
  },
  {
    "title": "Tamago",
    "name": "tamago",
    "image": "/tamago/tamago.png",
    "thumbnail" : "/tamago/tamagoThumbnail.png",
    "description": "Tamago - Game App",
    "date": "",
    "icon": "",
    "text": "The Tamago App is a delightful and interactive virtual pet game inspired by the classic Tamagotchi, but with a magical twist. In this game, you start by choosing one of two mystical dragon eggs: the Fire Egg or the Water Egg. Each egg brings its own unique set of challenges and care routines, creating a fun and engaging experience for players. Once you’ve selected your egg, it’s time to begin your journey as a dragon caretaker. If you choose the Water Egg, you’ll notice it becoming covered in grime and dirt as time goes by. To keep it healthy and happy, you’ll need to use a sponge to carefully clean the egg, ensuring it stays in top condition for the next stage of its growth. On the other hand, if you opt for the Fire Egg, it will periodically freeze over, and you must use a fire source to gently thaw it out, ensuring it remains warm and safe. Both of these eggs require your constant attention, as each one needs specific care at regular intervals. These tasks must be repeated over time, providing a fun challenge as you work to nurture the egg and prepare it for the momentous hatching. The ultimate goal is to help your dragon grow strong enough to hatch, bringing a new magical creature into the world.",
    "tools": ["Kotlin"],
    "imageGallery": [
      {
        "tile": "tamago image 1",
        "src": "/tamago/tamago-1.png"
      },
      {
        "tile": "tamago image 2",
        "src": "/tamago/tamago-2.png"
      },
      {
        "tile": "tamago image 2",
        "src": "/tamago/tamago-3.png"
      },
      {
        "tile": "tamago image 2",
        "src": "/tamago/tamago-4.png"
      }
    ],
    "links": [
      {
        "title": "Github",
        "image": "",
        "type": "link",
        "link": "https://github.com/LauraIkic/Tamago"
      }
    ]
  },
  {
    "title": "Cocktail Recipe App",
    "name": "cocktail",
    "image": "/cocktail/cocktail.png",
    "thumbnail" : "/cocktail/cocktailThumbnail.png",
    "date": "",
    "description": "Discover and Save Your Favorite Cocktails with This Swift-Based Mobile App",
    "icon": "",
    "text": "This Swift-based app lets users explore a variety of cocktails by fetching a list through an API. You can see details for each drink, like ingredients and info about its origins and preparation. The app also allows you to save your favorite cocktails to a personalized list, which is stored persistently in the app's delegates, so your favorites stay even if the app is closed. You can access your saved drinks anytime and remove them whenever you like. With an easy-to-use interface, this app is great for discovering new cocktails, keeping track of favorites, and revisiting them as you wish.",
    "tools": ["Swift"],
    "imageGallery": [
      {
        "tile": "maker space image 1",
        "src": "/cocktail/cocktail-1.png"
      }
    ],
    "links": [
      {
        "title": "Github",
        "image": "",
        "type": "link",
        "link": "https://github.com/LauraIkic/cocktailRecipes"
      }
    ]
  },


  {
    "title": "Lean Management Initiative",
    "name": "lean-man",
    "image": "/lmig/lmig.png",
    "thumbnail" : "/lmig/lmigThumbnail.png",
    "date": "",
    "description": "The Lean Management Initiative in Healthcare: Empowering Healthcare Organizations through Innovation",
    "icon": "",
    "text": "The healthcare industry is facing unprecedented challenges that demand innovative solutions. In response to these challenges, the Lean Management Initiative in Healthcare (LMIG) has emerged as a collaborative network of experts, dedicated to improving efficiency and sustainability within healthcare organizations. Through the collective expertise of professionals from various fields, LMIG aims to provide impactful solutions that enable healthcare leaders and teams to adapt quickly and effectively to both current and future demands.\n\nTo support this mission, I developed a modern, responsive website built on a powerful technology stack, including Vue.js, Nuxt.js, and Tailwind CSS. These tools allow us to create a user-friendly, dynamic platform that reflects the initiative's values of agility, efficiency, and innovation. The use of Vue.js and Nuxt.js ensures seamless performance and scalability, while Tailwind CSS offers a visually appealing and accessible design.\n\nThis website serves as a hub for the LMIG community, offering resources, networking opportunities, and insights, all aimed at fostering collaboration and driving meaningful change in the healthcare sector.",
    "tools":  ["Vue.js", "Nuxt" ,"Tailwind", "Netlify"],
    "imageGallery": [],
    "links": [
      {
        "title": "Website",
        "image": "",
        "type": "link",
        "link": "https://lmig.at"
      }
    ]
  },
  {
    "title": "Wedding Page",
    "name": "wedding",
    "image": "/wedding/weddingPage.png",
    "thumbnail" : "/wedding/weddingThumbnail.png",
    "date": "",
    "description": "Creating a Personal Wedding Website: A Digital Space to Celebrate Love and Share Moments",
    "icon": "",
    "text": "When some of the most important people in my life asked me to create a wedding website for them, I was truly honored. Their special day deserved a digital space as unique and memorable as the love they share, and I couldn’t wait to bring that vision to life. The goal was simple: to provide a beautiful, seamless way for their guests to access all the details about the wedding, from the ceremony schedule to registry information and everything in between.\n\nUsing Vue.js, Nuxt.js, and Tailwind CSS, I created a responsive, user-friendly platform that makes it easy for guests to stay informed and engaged. Vue.js and Nuxt.js ensured the website runs smoothly and loads quickly, while Tailwind CSS gave it a clean, elegant design that reflects the warmth and joy of the couple's love story. It was important to me that the site not only provided all the necessary information but also captured the spirit of their celebration.\n\nBuilding this website for people I care about was a deeply personal project, and I’m so happy it could play a small part in making their wedding day even more memorable. It's a digital space where their guests can connect, share in the excitement, and feel like they’re part of something truly special.",
    "tools": ["Vue.js", "Nuxt" , "Netlify"],
    "imageGallery": [],
    "links": [
      {
        "title": "Website",
        "image": "",
        "type": "link",
        "link": "https://karo-und-michi-2023.at/"
      }
    ]
  },
  {
    "title": "Registration Website",
    "name": "registration",
    "image": "/speeddating/speeddating.png",
    "thumbnail" : "/speeddating/speeddatingThumbnail.png",
    "date": "",
    "description": "Enhancing the Makerspace Experience: A Collaboration with the Makerspace Grand Garage",
    "icon": "",
    "text": "The Makerspace app was developed as a collaboration between my university and the Makerspace Grand Garage in Linz. Makerspaces are places where people can learn new skills and create projects on their own.\n\nThe app allowed users to log in to their accounts and view their profile data, such as invoices and booked workshops. It also displayed upcoming workshops and showed badges earned from past workshops. The app was designed with gamification in mind to encourage users to complete more workshops by making the process more engaging.\n\nThere were plans for additional features, such as the ability to book workshops directly through the app and stay updated with community news.\n\nDeveloped using Swift, the app retrieved data from the Grand Garage’s internal backend through API calls, ensuring users had up-to-date information on workshops and their profiles.",
    "tools": ["Symfony", "Vue.js" ,"Tailwind", "Platform.sh"],
    "imageGallery": [
      {
        "tile": "maker space image 1",
        "src": "/speeddating/speeddating-1.png"
      },
      {
        "tile": "maker space image 1",
        "src": "/speeddating//speeddating-2.png"
      }
    ],
    "links": [
    ]
  },
  {
    "title": "Portfolio V1",
    "name": "portfolio",
    "image": "/portfolio/portfolio.png",
    "thumbnail" : "/portfolio/portfolioThumbnail.png",
    "date": "",
    "description": "Portfolio",
    "icon": "",
    "text": "The Makerspace app was developed as a collaboration between my university and the Makerspace Grand Garage in Linz. Makerspaces are places where people can learn new skills and create projects on their own.\n\nThe app allowed users to log in to their accounts and view their profile data, such as invoices and booked workshops. It also displayed upcoming workshops and showed badges earned from past workshops. The app was designed with gamification in mind to encourage users to complete more workshops by making the process more engaging.\n\nThere were plans for additional features, such as the ability to book workshops directly through the app and stay updated with community news.\n\nDeveloped using Swift, the app retrieved data from the Grand Garage’s internal backend through API calls, ensuring users had up-to-date information on workshops and their profiles.",
    "tools": ["Nuxt.js", "Vue.js" ,"Tailwind", "Netlify"],
    "imageGallery": [
    ],
    "links": [
      {
        "title": "Website",
        "image": "",
        "type": "link",
        "link": "https://sunny-torrone-8929ad.netlify.app/"
      }
    ]
  }
]
